apache/nuttx/arch/arm/src/stm32h7/hardware/stm32_ethernet.h
/****************************************************************************
 * arch/arm/src/stm32h7/hardware/stm32_ethernet.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32_ETHERNET_H
#define __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32_ETHERNET_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

/* Content of this file requires verification before it is used with other
 * families
 */

#if defined(CONFIG_STM32_STM32H7RSXX) || \
    defined(CONFIG_STM32_STM32H7X0XX) || \
    defined(CONFIG_STM32_STM32H7X3XX) || \
    defined(CONFIG_STM32_STM32H7B3XX) || \
    defined(CONFIG_STM32_STM32H7X5XX) || \
    defined(CONFIG_STM32_STM32H7X7XX)

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

/* MAC Registers */

#define STM32_ETH_MACCR_OFFSET       0x0000 /* Ethernet MAC configuration register */
#define STM32_ETH_MAECR_OFFSET       0x0004 /* Ethernet MAC Extended operating mode configuration register */
#define STM32_ETH_MACPFR_OFFSET      0x0008 /* Ethernet MAC Packet filtering control register */
#define STM32_ETH_MACWTR_OFFSET      0x000C /* Ethernet MAC Watchdog timeout register */
#define STM32_ETH_MACHT0R_OFFSET     0x0010 /* Ethernet MAC hash table high register */
#define STM32_ETH_MACHT1R_OFFSET     0x0014 /* Ethernet MAC hash table low register */
#define STM32_ETH_MACVTR_OFFSET      0x0050 /* Ethernet MAC VLAN tag register */
#define STM32_ETH_MACQTXFCR_OFFSET   0x0070 /* Ethernet MAC Tx Queue flow control register */
#define STM32_ETH_MACRXFCR_OFFSET    0x0090 /* Ethernet MAC Tx Queue flow control register */

#define STM32_ETH_MACISR_OFFSET      0x00B0 /* Ethernet MAC interrupt status register */
#define STM32_ETH_MACIER_OFFSET      0x00B4 /* Ethernet MAC interrupt enable register */

#define STM32_ETH_MACMDIOAR_OFFSET   0x0200 /* Ethernet MAC MDIO address register */
#define STM32_ETH_MACMDIODR_OFFSET   0x0204 /* Ethernet MAC MDIO data register */
#define STM32_ETH_MACA0HR_OFFSET     0x0300 /* Address 0 high register */
#define STM32_ETH_MACA0LR_OFFSET     0x0304 /* Address 0 low register */

/* MAC Timestamp Registers */

#define STM32_ETH_MACTSCR_OFFSET    0x0B00 /* Ethernet MAC timestamp control register */
#define STM32_ETH_MACSSIR_OFFSET    0x0B04 /* Ethernet MAC sub-second increment register */
#define STM32_ETH_MACSTSR_OFFSET    0x0B08 /* Ethernet MAC system time seconds register */
#define STM32_ETH_MACSTNR_OFFSET    0x0B0C /* Ethernet MAC system time nanoseconds register */
#define STM32_ETH_MACSTSUR_OFFSET   0x0B10 /* Ethernet MAC system time seconds update register */
#define STM32_ETH_MACSTNUR_OFFSET   0x0B14 /* Ethernet MAC system time nanoseconds update register */
#define STM32_ETH_MACTSAR_OFFSET    0x0B18 /* Ethernet MAC timestamp addend register */
#define STM32_ETH_MACTSSR_OFFSET    0x0B20 /* Ethernet MAC timestamp status register */
#define STM32_ETH_MACPPSCR_OFFSET   0x0B70 /* Ethernet MAC PPS control register */
#define STM32_ETH_MACPPSTTSR_OFFSET 0x0B80 /* Ethernet MAC PPS target time seconds register */
#define STM32_ETH_MACPPSTTNR_OFFSET 0x0B84 /* Ethernet MAC PPS target time nanoseconds register */
#define STM32_ETH_MACPPSIR_OFFSET   0x0B88 /* Ethernet MAC PPS interval register */
#define STM32_ETH_MACPPSWR_OFFSET   0x0B8C /* Ethernet MAC PPS width register */

/* MTL Registers */

#define STM32_ETH_MTLOMR_OFFSET      0x0C00 /* Operating mode Register */
#define STM32_ETH_MTLISR_OFFSET      0x0C20 /* Interrupt status Register */
#define STM32_ETH_MTLTXQOMR_OFFSET   0x0D00 /* Tx queue operating mode Register */
#define STM32_ETH_MTLTXQUR_OFFSET    0x0D04 /* Tx queue underflow register */
#define STM32_ETH_MTLTXQDR_OFFSET    0x0D08 /* Tx queue debug register */
#define STM32_ETH_MTLQICSR_OFFSET    0x0D2C /* Queue interrupt control status Register */
#define STM32_ETH_MTLRXQOMR_OFFSET   0x0D30 /* Rx queue operating mode register */
#define STM32_ETH_MTLRXQMPOCR_OFFSET 0x0D34 /* Rx queue missed packet and overflow counter register */
#define STM32_ETH_MTLRXQDR_OFFSE     0x0D38 /* Rx queue debug register */

/* DMA Registers */

#define STM32_ETH_DMAMR_OFFSET       0x1000 /* Ethernet DMA Mode register */
#define STM32_ETH_DMASBMR_OFFSET     0x1004 /* Ethernet DMA system bus mode register */
#define STM32_ETH_DMAISR_OFFSET      0x1008 /* Ethernet DMA Interrupt status register */
#define STM32_ETH_DMADSR_OFFSET      0x100C /* Ethernet DMA Debug status register */
#define STM32_ETH_DMACCR_OFFSET      0x1100 /* Ethernet DMA Channel control register */
#define STM32_ETH_DMACTXCR_OFFSET    0x1104 /* Ethernet DMA Channel transmit control register */
#define STM32_ETH_DMACRXCR_OFFSET    0x1108 /* Ethernet DMA Channel receive control register */
#define STM32_ETH_DMACTXDLAR_OFFSET  0x1114 /* Ethernet DMA Channel Tx descriptor list address register */
#define STM32_ETH_DMACRXDLAR_OFFSET  0x111C /* Ethernet DMA Channel Rx descriptor list address register */
#define STM32_ETH_DMACTXDTPR_OFFSET  0x1120 /* Ethernet DMA Channel Tx descriptor tail pointer register */
#define STM32_ETH_DMACRXDTPR_OFFSET  0x1128 /* Ethernet DMA Channel Rx descriptor tail pointer register */
#define STM32_ETH_DMACTXRLR_OFFSET   0x112C /* Ethernet DMA Channel Tx descriptor ring length register */
#define STM32_ETH_DMACRXRLR_OFFSET   0x1130 /* Ethernet DMA Channel Rx descriptor ring length register */
#define STM32_ETH_DMACIER_OFFSET     0x1134 /* Ethernet DMA Channel interrupt enable register */
#define STM32_ETH_DMACRXIWTR_OFFSET  0x1138 /* Ethernet DMA Channel Rx interrupt wdt register */
#define STM32_ETH_DMACCATXDR_OFFSET  0x1144 /* Ethernet DMA Channel current application transmit descriptor register */
#define STM32_ETH_DMACCARXDR_OFFSET  0x114C /* Ethernet DMA Channel current application receive descriptor register */
#define STM32_ETH_DMACCATXBR_OFFSET  0x1154 /* Ethernet DMA Channel current application transmit buffer register */
#define STM32_ETH_DMACCARXBR_OFFSET  0x115C /* Ethernet DMA Channel current application receive buffer register */
#define STM32_ETH_DMACSR_OFFSET      0x1160 /* Ethernet DMA Channel status register */
#define STM32_ETH_DMACMFCR_OFFSET    0x116C /* Ethernet DMA Channel missed frame count register */

