apache/nuttx/arch/arm/src/stm32h7/hardware/stm32_ethernet.h
/* Register Base Addresses **************************************************/

/* MAC Registers */

#define STM32_ETH_MACCR              (STM32_EMAC_BASE+STM32_ETH_MACCR_OFFSET)
#define STM32_ETH_MACPFR             (STM32_EMAC_BASE+STM32_ETH_MACPFR_OFFSET)
#define STM32_ETH_MACHT0R            (STM32_EMAC_BASE+STM32_ETH_MACHT0R_OFFSET)
#define STM32_ETH_MACHT1R            (STM32_EMAC_BASE+STM32_ETH_MACHT1R_OFFSET)
#define STM32_ETH_MACVTR             (STM32_EMAC_BASE+STM32_ETH_MACVTR_OFFSET)
#define STM32_ETH_MACQTXFCR          (STM32_EMAC_BASE+STM32_ETH_MACQTXFCR_OFFSET)
#define STM32_ETH_MACRXFCR           (STM32_EMAC_BASE+STM32_ETH_MACRXFCR_OFFSET)
#define STM32_ETH_MACISR             (STM32_EMAC_BASE+STM32_ETH_MACISR_OFFSET)
#define STM32_ETH_MACIER             (STM32_EMAC_BASE+STM32_ETH_MACIER_OFFSET)

#define STM32_ETH_MACMDIOAR          (STM32_EMAC_BASE+STM32_ETH_MACMDIOAR_OFFSET)
#define STM32_ETH_MACMDIODR          (STM32_EMAC_BASE+STM32_ETH_MACMDIODR_OFFSET)
#define STM32_ETH_MACA0LR            (STM32_EMAC_BASE+STM32_ETH_MACA0LR_OFFSET)
#define STM32_ETH_MACA0HR            (STM32_EMAC_BASE+STM32_ETH_MACA0HR_OFFSET)

/* MAC Timestamp Registers */

#define STM32_ETH_MACTSCR           (STM32_EMAC_BASE+STM32_ETH_MACTSCR_OFFSET)
#define STM32_ETH_MACSSIR           (STM32_EMAC_BASE+STM32_ETH_MACSSIR_OFFSET)
#define STM32_ETH_MACSTSR           (STM32_EMAC_BASE+STM32_ETH_MACSTSR_OFFSET)
#define STM32_ETH_MACSTNR           (STM32_EMAC_BASE+STM32_ETH_MACSTNR_OFFSET)
#define STM32_ETH_MACSTSUR          (STM32_EMAC_BASE+STM32_ETH_MACSTSUR_OFFSET)
#define STM32_ETH_MACSTNUR          (STM32_EMAC_BASE+STM32_ETH_MACSTNUR_OFFSET)
#define STM32_ETH_MACTSAR           (STM32_EMAC_BASE+STM32_ETH_MACTSAR_OFFSET)
#define STM32_ETH_MACTSSR           (STM32_EMAC_BASE+STM32_ETH_MACTSSR_OFFSET)
#define STM32_ETH_MACPPSCR          (STM32_EMAC_BASE+STM32_ETH_MACPPSCR_OFFSET)
#define STM32_ETH_MACPPSTTSR        (STM32_EMAC_BASE+STM32_ETH_MACPPSTTSR_OFFSET)
#define STM32_ETH_MACPPSTTNR        (STM32_EMAC_BASE+STM32_ETH_MACPPSTTNR_OFFSET)
#define STM32_ETH_MACPPSIR          (STM32_EMAC_BASE+STM32_ETH_MACPPSIR_OFFSET)
#define STM32_ETH_MACPPSWR          (STM32_EMAC_BASE+STM32_ETH_MACPPSWR_OFFSET)

/* MTL Registers */

#define STM32_ETH_MTLOMR             (STM32_EMAC_BASE+STM32_ETH_MTLOMR_OFFSET)
#define STM32_ETH_MTLISR             (STM32_EMAC_BASE+STM32_ETH_MTLISR_OFFSET)
#define STM32_ETH_MTLTXQOMR          (STM32_EMAC_BASE+STM32_ETH_MTLTXQOMR_OFFSET)
#define STM32_ETH_MTLTXQUR           (STM32_EMAC_BASE+STM32_ETH_MTLTXQUR_OFFSET)
#define STM32_ETH_MTLTXQDR           (STM32_EMAC_BASE+STM32_ETH_MTLTXQDR_OFFSET)
#define STM32_ETH_MTLQICSR           (STM32_EMAC_BASE+STM32_ETH_MTLQICSR_OFFSET)
#define STM32_ETH_MTLRXQOMR          (STM32_EMAC_BASE+STM32_ETH_MTLRXQOMR_OFFSET)
#define STM32_ETH_MTLRXQMPOCR        (STM32_EMAC_BASE+STM32_ETH_MTLRXQMPOCR_OFFSET)
#define STM32_ETH_MTLRXQDR           (STM32_EMAC_BASE+STM32_ETH_MTLRXQDR_OFFSE)

/* DMA Registers */

#define STM32_ETH_DMAMR              (STM32_EMAC_BASE+STM32_ETH_DMAMR_OFFSET)
#define STM32_ETH_DMASBMR            (STM32_EMAC_BASE+STM32_ETH_DMASBMR_OFFSET)
#define STM32_ETH_DMAISR             (STM32_EMAC_BASE+STM32_ETH_DMAISR_OFFSET)
#define STM32_ETH_DMADSR             (STM32_EMAC_BASE+STM32_ETH_DMADSR_OFFSET)
#define STM32_ETH_DMACCR             (STM32_EMAC_BASE+STM32_ETH_DMACCR_OFFSET)
#define STM32_ETH_DMACTXCR           (STM32_EMAC_BASE+STM32_ETH_DMACTXCR_OFFSET)
#define STM32_ETH_DMACRXCR           (STM32_EMAC_BASE+STM32_ETH_DMACRXCR_OFFSET)
#define STM32_ETH_DMACTXDLAR         (STM32_EMAC_BASE+STM32_ETH_DMACTXDLAR_OFFSET)
#define STM32_ETH_DMACRXDLAR         (STM32_EMAC_BASE+STM32_ETH_DMACRXDLAR_OFFSET)
#define STM32_ETH_DMACTXDTPR         (STM32_EMAC_BASE+STM32_ETH_DMACTXDTPR_OFFSET)
#define STM32_ETH_DMACRXDTPR         (STM32_EMAC_BASE+STM32_ETH_DMACRXDTPR_OFFSET)
#define STM32_ETH_DMACTXRLR          (STM32_EMAC_BASE+STM32_ETH_DMACTXRLR_OFFSET)
#define STM32_ETH_DMACRXRLR          (STM32_EMAC_BASE+STM32_ETH_DMACRXRLR_OFFSET)
#define STM32_ETH_DMACIER            (STM32_EMAC_BASE+STM32_ETH_DMACIER_OFFSET)
#define STM32_ETH_DMACRXIWTR         (STM32_EMAC_BASE+STM32_ETH_DMACRXIWTR_OFFSET)
#define STM32_ETH_DMACCATXDR         (STM32_EMAC_BASE+STM32_ETH_DMACCATXDR_OFFSET)
#define STM32_ETH_DMACCARXDR         (STM32_EMAC_BASE+STM32_ETH_DMACCARXDR_OFFSET)
#define STM32_ETH_DMACCATXBR         (STM32_EMAC_BASE+STM32_ETH_DMACCATXBR_OFFSET)
#define STM32_ETH_DMACCARXBR         (STM32_EMAC_BASE+STM32_ETH_DMACCARXBR_OFFSET)
#define STM32_ETH_DMACSR             (STM32_EMAC_BASE+STM32_ETH_DMACSR_OFFSET)
#define STM32_ETH_DMACMFCR           (STM32_EMAC_BASE+STM32_ETH_DMACMFCR_OFFSET)

/* Register Bit-Field Definitions *******************************************/

/* MAC Registers */

/* Ethernet MAC configuration register */

#define ETH_MACCR_RE                 (1 << 0)  /* Bit 0:  Receiver enable */
#define ETH_MACCR_TE                 (1 << 1)  /* Bit 1:  Transmitter enable */
#define ETH_MACCR_PRELEN_SHIFT       (2)       /* Bits 2-3: Preamble length for transmit packets */
#define ETH_MACCR_PRELEN_MASK        (3 << ETH_MACCR_PRELEN_SHIFT)
#  define ETH_MACCR_PRELEN_7         (0 << ETH_MACCR_PRELEN_SHIFT) /* 00: 7 bytes of preamble */
#  define ETH_MACCR_PRELEN_5         (1 << ETH_MACCR_PRELEN_SHIFT) /* 01: 5 bytes of preamble */
#  define ETH_MACCR_PRELEN_3         (2 << ETH_MACCR_PRELEN_SHIFT) /* 10: 3 bytes of preamble */

#define ETH_MACCR_DC                 (1 << 4)  /* Bit 4:  Deferral check */
#define ETH_MACCR_BL_SHIFT           (5)       /* Bits 5-6: Back-off limit */
#define ETH_MACCR_BL_MASK            (3 << ETH_MACCR_BL_SHIFT)
#  define ETH_MACCR_BL_10            (0 << ETH_MACCR_BL_SHIFT) /* 00: k = min (n, 10) */
#  define ETH_MACCR_BL_8             (1 << ETH_MACCR_BL_SHIFT) /* 01: k = min (n, 8) */
#  define ETH_MACCR_BL_4             (2 << ETH_MACCR_BL_SHIFT) /* 10: k = min (n, 4) */
#  define ETH_MACCR_BL_1             (3 << ETH_MACCR_BL_SHIFT) /* 11: k = min (n, 1) */

#define ETH_MACCR_DR                 (1 << 8)  /* Bit 8:  Retry disable */
#define ETH_MACCR_DCRS               (1 << 9)  /* Bit 9: Carrier sense disable */
#define ETH_MACCR_DO                 (1 << 10) /* Bit 10: Disable receive own */
#define ETH_MACCR_LM                 (1 << 12) /* Bit 12: Loopback mode */
#define ETH_MACCR_DM                 (1 << 13) /* Bit 13: Duplex mode */
#define ETH_MACCR_FES                (1 << 14) /* Bit 14: Fast Ethernet speed */
#define ETH_MACCR_JE                 (1 << 16) /* Bit 16: Jumbo packet enable */
#define ETH_MACCR_JD                 (1 << 17) /* Bit 17: Jabber disable */
#define ETH_MACCR_WD                 (1 << 19) /* Bit 19: Watchdog disable */
#define ETH_MACCR_ACS                (1 << 20) /* Bit 20:  Automatic pad/CRC stripping */
#define ETH_MACCR_CST                (1 << 21) /* Bit 21: CRC stripping for Type frames */
#define ETH_MACCR_S2KP               (1 << 22) /* Bit 22: IEEE 802.3as Support for 2K Packets */
#define ETH_MACCR_GPSLCE             (1 << 23) /* Bit 23: Giant Packet Size Limit Control Enable */
#define ETH_MACCR_IPG_SHIFT          (24)      /* Bits 24-26: Inter-packet gap */
#define ETH_MACCR_IPG_MASK           (7 << ETH_MACCR_IPG_SHIFT)
#  define ETH_MACCR_IPG(n)           ((12-((n) >> 3)) << ETH_MACCR_IPG_SHIFT) /* n bit times, n=40,48,..96 */

