apache/nuttx/arch/arm/src/stm32h7/hardware/stm32_ethernet.h
#define ETH_MACCR_IPC                (1 << 27) /* Bit 27: IPv4 checksum offload */
#define ETH_MACCR_SARC_SHIFT         (28)      /* Bits 28-30: Source Address Insertion or Replacement Control */
#define ETH_MACCR_SARC_MASK          (7 << ETH_MACCR_SARC_SHIFT)
#define ETH_MACCR_ARPEN              (1 << 31) /* Bit 31: ARP Offload Enable */

/* Ethernet MAC frame filter register */

#define ETH_MACPFR_PM                (1 << 0)  /* Bit 0: Promiscuous mode */
#define ETH_MACPFR_HUC               (1 << 1)  /* Bit 1: Hash unicast */
#define ETH_MACPFR_HMC               (1 << 2)  /* Bit 2: Hash multicast */
#define ETH_MACPFR_DAIF              (1 << 3)  /* Bit 3: Destination address inverse filtering */
#define ETH_MACPFR_PAM               (1 << 4)  /* Bit 4: Pass all multicast */
#define ETH_MACPFR_DBF               (1 << 5)  /* Bit 5: Disable broadcast packets */
#define ETH_MACPFR_PCF_SHIFT         (6)       /* Bits 6-7: Pass control frames */
#define ETH_MACPFR_PCF_MASK          (3 << ETH_MACPFR_PCF_SHIFT)
#  define ETH_MACPFR_PCF_NONE        (0 << ETH_MACPFR_PCF_SHIFT) /* Prevents all control frames */
#  define ETH_MACPFR_PCF_PAUSE       (1 << ETH_MACPFR_PCF_SHIFT) /* Prevents all except Pause control frames */
#  define ETH_MACPFR_PCF_ALL         (2 << ETH_MACPFR_PCF_SHIFT) /* Forwards all control frames */
#  define ETH_MACPFR_PCF_FILTER      (3 << ETH_MACPFR_PCF_SHIFT) /* Forwards all that pass address filter */

#define ETH_MACPFR_SAIF              (1 << 8)  /* Bit 8: Source address inverse filtering */
#define ETH_MACPFR_SAF               (1 << 9)  /* Bit 9: Source address filter */
#define ETH_MACPFR_HPF               (1 << 10) /* Bit 10: Hash or perfect filter */
#define ETH_MACPFR_VTFE              (1 << 16) /* Bit 16: VLAN Tag Filter Enable */
#define ETH_MACPFR_IPFE              (1 << 20) /* Bit 20: Layer 3 and Layer 4 Filter Enable */
#define ETH_MACPFR_DNTU              (1 << 21) /* Bit 21: Drop Non-TCP/UDP over IP Packets */
#define ETH_MACPFR_RA                (1 << 31) /* Bit 31: Receive all */

/* Ethernet MAC VLAN tag register */

#define ETH_MACVTR_VL_SHIFT     (0)       /* Bits 0-15: VLAN tag identifier (for receive frames) */
#define ETH_MACVTR_VL_MASK      (0xffff << ETH_MACVLANTR_VL_SHIFT)
#  define ETH_MACVTR_VL(n)      ((uint32_t)(n) << ETH_MACVLANTR_VL_SHIFT)
#define ETH_MACVLANTR_ETV       (1 << 16) /* Bit 16: Enable 12-Bit VLAN Tag Comparison */

/* Ethernet MAC Tx Queue flow control register */

#define ETH_MACQTXFCR_FCB_BPA           (1 << 0)  /* Bit 0: Flow control busy/back pressure activate */
#define ETH_MACQTXFCR_TFE               (1 << 1)  /* Bit 1: Transmit flow control enable */
#define ETH_MACQTXFCR_PLT_SHIFT         (4)       /* Bits 4-6: Pause low threshold */
#define ETH_MACQTXFCR_PLT_MASK          (7 << ETH_MACQTXFCR_PLT_SHIFT)
#  define ETH_MACQTXFCR_PLT_M4          (0 << ETH_MACQTXFCR_PLT_SHIFT) /* 000 PT - 4 slot times */
#  define ETH_MACQTXFCR_PLT_M28         (1 << ETH_MACQTXFCR_PLT_SHIFT) /* 001 PT - 28 slot times */
#  define ETH_MACQTXFCR_PLT_M36         (2 << ETH_MACQTXFCR_PLT_SHIFT) /* 010 PT - 36 slot times */
#  define ETH_MACQTXFCR_PLT_M144        (3 << ETH_MACQTXFCR_PLT_SHIFT) /* 011 PT - 144 slot times */
#  define ETH_MACQTXFCR_PLT_M256        (4 << ETH_MACQTXFCR_PLT_SHIFT) /* 100 PT - 256 slot times */
#  define ETH_MACQTXFCR_PLT_M512        (5 << ETH_MACQTXFCR_PLT_SHIFT) /* 101 PT - 512 slot times */

#define ETH_MACQTXFCR_DZPQ              (1 << 7)  /* Bit 7: Zero-quanta pause disable */
#define ETH_MACQTXFCR_PT_SHIFT          (16)      /* Bits 16-31: Pause Time */
#define ETH_MACQTXFCR_PT_MASK           (0xFFFF << ETH_MACQTXFCR_PT_SHIFT)
#define ETH_MACQTXFCR_PT(n)             ((uint32_t)(n) << ETH_MACQTXFCR_PT_SHIFT)

/* Ethernet MAC Rx flow control register */

#define ETH_MACRXFCR_RFE              (1 << 0)  /* Bit 0: Receive flow control enable */
#define ETH_MACRXFCR_UP               (1 << 1)  /* Bit 1: Unicast pause frame detect */

/* Ethernet MAC interrupt status register */

#define ETH_MACISR_PHYIS               (1 << 3)  /* Bit 3: PHY interrupt */
#define ETH_MACISR_PMTIS               (1 << 4)  /* Bit 4: PMT Interrupt Status */
#define ETH_MACISR_LPIIS               (1 << 5)  /* Bit 5: LPI Interrupt Status */
#define ETH_MACISR_MMCIS               (1 << 8)  /* Bit 8: MMC Interrupt Status */
#define ETH_MACISR_MMCRXIS             (1 << 9)  /* Bit 9: MMC Receive Interrupt Status */
#define ETH_MACISR_MMCTXIS             (1 << 10) /* Bit 10: MMC Transmit Interrupt Status */
#define ETH_MACISR_TSIS                (1 << 12) /* Bit 12: Timestamp Interrupt Status */
#define ETH_MACISR_TXTSIS              (1 << 13) /* Bit 13: Transmit Status Interrupt */
#define ETH_MACISR_RXSTSIS             (1 << 14) /* Bit 14: Receive Status Interrupt */

/* Ethernet MAC interrupt mask register */

#define ETH_MACIER_PHYIE             (1 << 3)  /* Bit 3: PHY interrupt mask */
#define ETH_MACIER_PMTIE             (1 << 4)  /* Bit 4: PMT Interrupt Enable */
#define ETH_MACIER_LPIIE             (1 << 5)  /* Bit 5: LPI Interrupt Enable */
#define ETH_MACIER_TSIE              (1 << 12) /* Bit 12: Timestamp Interrupt Enable */
#define ETH_MACIER_TXSTSIE           (1 << 13) /* Bit 13: Transmit Status Interrupt Enable */
#define ETH_MACIER_RXSTSIE           (1 << 14) /* Bit 14: Receive Status Interrupt Enable */
#define ETH_MACIER_ALLINTS           (ETH_MACIER_PHYIE | ETH_MACIER_PMTIE | ETH_MACIER_LPIIE |\
                                      ETH_MACIER_TSIE | ETH_MACIER_TXSTSIE | ETH_MACIER_RXSTSIE)

/* Ethernet MAC MDIO address register */

#define ETH_MACMDIOAR_MB              (1 << 0)  /* Bit 0: MII busy */
#define ETH_MACMDIOAR_C45E            (1 << 1)  /* Bit 1: Clause 45 PHY Enable */
#define ETH_MACMDIOAR_GOC_SHIFT       (2)       /* Bits 2-3: MII Operation Command */

#  define ETH_MACMDIOAR_GOC_WRITE     (1 << ETH_MACMDIOAR_GOC_SHIFT) /* Write */
#  define ETH_MACMDIOAR_GOC_PRIA      (2 << ETH_MACMDIOAR_GOC_SHIFT) /* Post Read Increment Address for Clause 45 PHY */
#  define ETH_MACMDIOAR_GOC_READ      (3 << ETH_MACMDIOAR_GOC_SHIFT) /* Read */

#define ETH_MACMDIOAR_SKAP            (1 << 4)  /* Bit 4: Skip Address Packet */
#define ETH_MACMDIOAR_CR_SHIFT        (8)       /* Bits 8-11: Clock range */
#define ETH_MACMDIOAR_CR_MASK         (15 << ETH_MACMDIOAR_CR_SHIFT)
#  define ETH_MACMDIOAR_CR_DIV42      (0 << ETH_MACMDIOAR_CR_SHIFT) /* 60-100  MHz HCLK/42 */
#  define ETH_MACMDIOAR_CR_DIV62      (1 << ETH_MACMDIOAR_CR_SHIFT) /* 100-150 MHz HCLK/62 */
#  define ETH_MACMDIOAR_CR_DIV16      (2 << ETH_MACMDIOAR_CR_SHIFT) /* 20-35   MHz HCLK/16 */
#  define ETH_MACMDIOAR_CR_DIV26      (3 << ETH_MACMDIOAR_CR_SHIFT) /* 35-60   MHz HCLK/26 */
#  define ETH_MACMDIOAR_CR_DIV102     (4 << ETH_MACMDIOAR_CR_SHIFT) /* 150-250 MHz HCLK/102 */
#  define ETH_MACMDIOAR_CR_DIV124     (5 << ETH_MACMDIOAR_CR_SHIFT) /* 250-300 MHz HCLK/124 */

