apache/nuttx/arch/arm/src/stm32h7/hardware/stm32_ethernet.h
#define ETH_MACMDIOAR_NTC_SHIFT       (12)       /* Bits 12-14: Number of Training Clocks */
#define ETH_MACMDIOAR_NTC_MASK        (7 << ETH_MACMDIOAR_NTC_SHIFT)
#  define ETH_MACMDIOAR_NTC(n)        ((uint32_t)(n) << ETH_MACMDIOAR_NTC_SHIFT)
#define ETH_MACMDIOAR_RDA_SHIFT       (16)       /* Bits 16-20: MII register */
#define ETH_MACMDIOAR_RDA_MASK        (31 << ETH_MACMDIOAR_RDA_SHIFT)
#  define ETH_MACMDIOAR_RDA(n)        ((uint32_t)(n) << ETH_MACMDIOAR_RDA_SHIFT)
#define ETH_MACMDIOAR_PA_SHIFT        (21)      /* Bits 21-25: PHY address */
#define ETH_MACMDIOAR_PA_MASK         (31 << ETH_MACMDIOAR_PA_SHIFT)
#  define ETH_MACMDIOAR_PA(n)         ((uint32_t)(n) << ETH_MACMDIOAR_PA_SHIFT)
#define ETH_MACMDIOAR_BTB             (1 << 26)  /* Bit 26: Back to Back transactions */
#define ETH_MACMDIOAR_PSE             (1 << 27)  /* Bit 27: Preamble Suppression Enable */

#define STM32_ETH_MACAxHR_MBC_SHIFT   (24) /* Bits 24-29: Mask Byte Control */
#define STM32_ETH_MACAxHR_MBC_MASK    (0x3f << STM32_ETH_MACA0HR_MBC_SHIFT)
#define STM32_ETH_MACAxHR_SA          (1 << 30) /* Bit 30: Source Address */
#define STM32_ETH_MACAxHR_AE          (1 << 31) /* Bit 31: Address Enable */

/* Ethernet MAC timestamp control register */

#define ETH_MACTSCR_TSENA           (1 << 0)  /* Bit 0: Enable timestamp */
#define ETH_MACTSCR_TSCFUPDT        (1 << 1)  /* Bit 1: Fine or coarse timestamp update */
#define ETH_MACTSCR_TSINIT          (1 << 2)  /* Bit 2: Initialize timestamp */
#define ETH_MACTSCR_TSUPDT          (1 << 3)  /* Bit 3: Update timestamp */
#define ETH_MACTSCR_TSADDREG        (1 << 5)  /* Bit 5: Update addend register */
#define ETH_MACTSCR_TSENALL         (1 << 8)  /* Bit 8: Enable timestamp for all packets */
#define ETH_MACTSCR_TSCTRLSSR       (1 << 9)  /* Bit 9: Timestamp digital or binary rollover control */
#define ETH_MACTSCR_TSVER2ENA       (1 << 10) /* Bit 10: Enable PTP packet processing for version 2 format */
#define ETH_MACTSCR_TSIPENA         (1 << 11) /* Bit 11: Enable processing of PTP over Ethernet packets */
#define ETH_MACTSCR_TSIPV6ENA       (1 << 12) /* Bit 12: Enable processing of PTP packets sent over IPv6-UDP */
#define ETH_MACTSCR_TSIPV4ENA       (1 << 13) /* Bit 13: Enable processing of PTP packets sent over IPv4-UDP */
#define ETH_MACTSCR_TSEVNTENA       (1 << 14) /* Bit 14: Enable timestamp snapshot for event messages */
#define ETH_MACTSCR_TSMSTRENA       (1 << 15) /* Bit 15: Enable snapshot for messages relevant to master */
#define ETH_MACTSCR_SNAPTYPSEL_SHIFT (16)     /* Bits 16-17: Select PTP packets for taking snapshots */
#define ETH_MACTSCR_SNAPTYPSEL_MASK (0x3 << ETH_MACTSCR_SNAPTYPSEL_SHIFT)
#define ETH_MACTSCR_TSENMACADDR     (1 << 18) /* Bit 18: Enable MAC address for PTP packet filtering */
#define ETH_MACTSCR_CSC             (1 << 19) /* Bit 19: Checksum correction for PTP over UDP/IPv4 (one-step) */
#define ETH_MACTSCR_TXTSSTSM        (1 << 24) /* Bit 24: Transmit timestamp status mode */

/* Ethernet MAC sub-second increment register */

#define ETH_MACSSIR_SNSINC_SHIFT    (8)       /* Bits 8-15: Sub-nanosecond increment value */
#define ETH_MACSSIR_SNSINC_MASK     (0xFF << ETH_MACSSIR_SNSINC_SHIFT)
#define ETH_MACSSIR_SSINC_SHIFT     (16)      /* Bits 16-23: Sub-second increment value */
#define ETH_MACSSIR_SSINC_MASK      (0xFF << ETH_MACSSIR_SSINC_SHIFT)

/* Ethernet MAC system time nanoseconds register */

#define ETH_MACSTNR_TSSS_SHIFT      (0)       /* Bits 0-30: Timestamp sub-seconds */
#define ETH_MACSTNR_TSSS_MASK       (0x7FFFFFFF << ETH_MACSTNR_TSSS_SHIFT)

/* Ethernet MAC system time nanoseconds update register */

#define ETH_MACSTNUR_TSSS_SHIFT     (0)       /* Bits 0-30: Timestamp sub-seconds */
#define ETH_MACSTNUR_TSSS_MASK      (0x7FFFFFFF << ETH_MACSTNUR_TSSS_SHIFT)
#define ETH_MACSTNUR_ADDSUB         (1 << 31) /* Bit 31: Add or subtract time */

/* Ethernet MAC timestamp status register */

#define ETH_MACTSSR_TSSOVF          (1 << 0)  /* Bit 0: Timestamp seconds overflow */
#define ETH_MACTSSR_TSTARGT0        (1 << 1)  /* Bit 1: Timestamp target time reached */
#define ETH_MACTSSR_AUXTSTRIG       (1 << 2)  /* Bit 2: Auxiliary timestamp trigger snapshot */
#define ETH_MACTSSR_TSTRGTERR0      (1 << 3)  /* Bit 3: Timestamp target time error */
#define ETH_MACTSSR_TXTSSIS         (1 << 15) /* Bit 15: Tx timestamp status interrupt status */
#define ETH_MACTSSR_ATSSTN_SHIFT    (16)      /* Bits 16-19: Auxiliary timestamp snapshot trigger identifier */
#define ETH_MACTSSR_ATSSTN_MASK     (0xF << ETH_MACTSSR_ATSSTN_SHIFT)
#define ETH_MACTSSR_ATSSTM          (1 << 24) /* Bit 24: Auxiliary timestamp snapshot trigger missed */
#define ETH_MACTSSR_ATSNS_SHIFT     (25)      /* Bits 25-29: Number of auxiliary timestamp snapshots */
#define ETH_MACTSSR_ATSNS_MASK      (0x1F << ETH_MACTSSR_ATSNS_SHIFT)

/* Ethernet MAC PPS control register */

#define ETH_MACPPSCR_PPSCTRL_SHIFT  (0)       /* Bits 0-3: PPS output frequency control or command */
#define ETH_MACPPSCR_PPSCTRL_MASK   (0xF << ETH_MACPPSCR_PPSCTRL_SHIFT)
#  define ETH_MACPPSCR_PPSCMD_START_TRAIN (2 << ETH_MACPPSCR_PPSCTRL_SHIFT)
#  define ETH_MACPPSCR_PPSCMD_STOP_NOW    (5 << ETH_MACPPSCR_PPSCTRL_SHIFT)
#define ETH_MACPPSCR_PPSEN0         (1 << 4)  /* Bit 4: Flexible PPS output mode enable */

/* Ethernet MAC PPS target time nanoseconds register */

#define ETH_MACPPSTTNR_TTSL0_SHIFT  (0)       /* Bits 0-30: Target time low */
#define ETH_MACPPSTTNR_TTSL0_MASK   (0x7FFFFFFF << ETH_MACPPSTTNR_TTSL0_SHIFT)
#define ETH_MACPPSTTNR_TRGTBUSY0    (1 << 31) /* Bit 31: PPS target time register busy */

/* Ethernet MTL registers */

#define ETH_MTLOMR_DTXSTS             (1 << 0)   /* Bit 0: Drop Transmit Status */
#define ETH_MTLOMR_CNTPRST            (1 << 8)   /* Bit 8: Counters Preset */
#define ETH_MTLOMR_CNTCLR             (1 << 9)   /* Bit 9: Counters Reset */

#define ETH_MTLISR_Q0IS               (1 << 0)   /* Bit 0: Queue interrupt status */

#define ETH_MTLTXQOMR_FTQ             (1 << 0)   /* Bit 0: Flush Transmit Queue */
#define ETH_MTLTXQOMR_TSF             (1 << 1)   /* Bit 1: Transmit Store and Forward */
#define ETH_MTLTXQOMR_TXQEN_SHIFT     (2)        /* Bits 2-3: Transmit Queue Enable */
#define ETH_MTLTXQOMR_TXQEN_MASK      (0x3 << ETH_MTLTXQOMR_TXQEN_SHIFT)
#define ETH_MTLTXQOMR_TXQEN_DISABLED  (0)
#define ETH_MTLTXQOMR_TXQEN_ENABLED   (2)

#define ETH_MTLTXQOMR_TTC_SHIFT       (4)        /* Bits 4-6: Transmit Threshold Control */
#define ETH_MTLTXQOMR_TTC_MASK        (0x7 << ETH_MTLTXQOMR_TTC_SHIFT)
#  define ETH_MTLTXQOMR_TTC_32        (0x0 << ETH_MTLTXQOMR_TTC_SHIFT)
#  define ETH_MTLTXQOMR_TTC_64        (0x1 << ETH_MTLTXQOMR_TTC_SHIFT)
#  define ETH_MTLTXQOMR_TTC_96        (0x2 << ETH_MTLTXQOMR_TTC_SHIFT)
#  define ETH_MTLTXQOMR_TTC_128       (0x3 << ETH_MTLTXQOMR_TTC_SHIFT)
#  define ETH_MTLTXQOMR_TTC_192       (0x4 << ETH_MTLTXQOMR_TTC_SHIFT)
#  define ETH_MTLTXQOMR_TTC_256       (0x5 << ETH_MTLTXQOMR_TTC_SHIFT)
#  define ETH_MTLTXQOMR_TTC_364       (0x6 << ETH_MTLTXQOMR_TTC_SHIFT)
#  define ETH_MTLTXQOMR_TTC_512       (0x7 << ETH_MTLTXQOMR_TTC_SHIFT)
#define ETH_MTLTXQOMR_TQS_SHIFT       (16)       /* Bits 16-24: Transmit Queue Size */
#define ETH_MTLTXQOMR_TQS_MASK        (0x1ff << ETH_MTLTXQOMR_TQS_SHIFT)

#define ETH_MTLTXQUR_UFFRMCNT_SHIFT   (0)       /* Underflow Packet Counter */
#define ETH_MTLTXQUR_UFFRMCNT_MASK    (0x7ff << ETH_MTLTXQUR_UFFRMCNT_SHIFT)
#define ETH_MTLTXQUR_UFCNTOVF         (1 << 11)

#define ETH_MTLTXQDR_TXQPAUSED        (1 << 0)  /* Transmit Queue in Pause */
#define ETH_MTLTXQDR_TRCSTS_SHIFT     (1)       /* MTL Tx Queue Read Controller Status */
#define ETH_MTLTXQDR_TRCSTS_MASK      (0x3 << ETH_MTLTXQDR_TRCSTS_SHIFT)
#define ETH_MTLTXQDR_TWCSTS           (1 << 3)  /* Bit 3: MTL Tx Queue Write Controller Status */
#define ETH_MTLTXQDR_TXQSTS           (1 << 4)  /* Bit 4: MTL Tx Queue Not Empty Status */
#define ETH_MTLTXQDR_TXSTSFSTS        (1 << 5)  /* Bit 5: MTL Tx Status FIFO Full Status */
#define ETH_MTLTXQDR_PTXQ_SHIFT       (16)      /* Bits 16-18: Number of Packets in the Transmit Queue */
#define ETH_MTLTXQDR_PTXQ_MASK        (0x7 << ETH_MTLTXQDR_PTXQ_SHIFT)
#define ETH_MTLTXQDR_STXSTSF_SHIFT    (20)      /* Bits 20-22: Number of Status Words in Tx Status FIFO of Queue */
#define ETH_MTLTXQDR_STXSTSF_MASK     (0x7 << ETH_MTLTXQDR_STXSTSF_SHIFT)

