apache/nuttx/arch/arm/src/stm32h7/hardware/stm32_ethernet.h
#define ETH_MTLQICSR_TXUNFIS    (1 << 0)  /* Bit 0: Transmit Queue Underflow Interrupt Status */
#define ETH_MTLQICSR_TXUIE      (1 << 8)  /* Bit 8: Transmit Queue Underflow Interrupt Enable */
#define ETH_MTLQICSR_RXOVFIS    (1 << 16) /* Bit 16: Receive Queue Overflow Interrupt Status */
#define ETH_MTLQICSR_RXOIE      (1 << 24) /* Bit 24: Receive Queue Overflow Interrupt Enable */

#define ETH_MTLRXQOMR_RTC_SHIFT  (0)      /* Bits 0-1: Receive Queue Threshold Control */
#define ETH_MTLRXQOMR_RTC_MASK   (0x3 << ETH_MTLRXQOMR_RTC_SHIFT)
#  define ETH_MTLRXQOMR_RTC_64   (0x0 << ETH_MTLRXQOMR_RTC_SHIFT)
#  define ETH_MTLRXQOMR_RTC_32   (0x1 << ETH_MTLRXQOMR_RTC_SHIFT)
#  define ETH_MTLRXQOMR_RTC_96   (0x2 << ETH_MTLRXQOMR_RTC_SHIFT)
#  define ETH_MTLRXQOMR_RTC_128  (0x3 << ETH_MTLRXQOMR_RTC_SHIFT)
#define ETH_MTLRXQOMR_FUP        (1 << 3) /* Bit 3: Forward Undersized Good Packets */
#define ETH_MTLRXQOMR_FEP        (1 << 4) /* Bit 4: Forward Error Packets */
#define ETH_MTLRXQOMR_RSF        (1 << 5) /* Bit 5: Receive Queue Store and Forward */
#define ETH_MTLRXQOMR_DIS_TCP_EF (1 << 6) /* Bit 6: Disable Dropping of TCP/IP Checksum Error Packets */
#define ETH_MTLRXQOMR_EHFC       (1 << 7) /* Bit 7: Enable Hardware Flow Control */
#define ETH_MTLRXQOMR_RFA_SHIFT  (8)      /* Bits 8-10: Threshold for Activating Flow Control */
#define ETH_MTLRXQOMR_RFA_MASK   (0x7 << ETH_MTLRXQOMR_RFA_SHIFT)
#define ETH_MTLRXQOMR_RFD_SHIFT  (14)     /* Bits 14-16: Threshold for Deactivating Flow Control */
#define ETH_MTLRXQOMR_RFD_MASK   (0x7 << ETH_MTLRXQOMR_RFD_SHIFT)
#define ETH_MTLRXQOMR_RQS_SHIFT  (20)     /* Bits 20-22: Receive Queue Size */
#define ETH_MTLRXQOMR_RQS_MASK   (0x7 << ETH_MTLRXQOMR_RQS_SHIFT)

#define ETH_MTLRXQMPOCR_OVFPKTCNT_SHIFT (0)       /* Bits 0-10: Overflow Packet Counter */
#define ETH_MTLRXQMPOCR_OVFPKTCNT_MASK  (0x7ff << ETH_MTLRXQMPOCR_OVFPKTCNT_SHIFT)
#define ETH_MTLRXQMPOCR_OVFCNTOVF       (1 << 11) /* Bit 11: Overflow Counter Overflow Bit */
#define ETH_MTLRXQMPOCR_MISPKTCNT_SHIFT (16)      /* Bits 16-26: Missed Packet Counter */
#define ETH_MTLRXQMPOCR_MISPKTCNT_MASK  (0x7ff << ETH_MTLRXQMPOCR_MISPKTCNT_SHIFT)
#define ETH_MTLRXQMPOCR_MISCNTOVF       (1 << 27) /* Bit 27: Missed Packet Counter Overflow Bit */

#define ETH_MTLRXQDR_RWCSTS         (1 << 0) /* Bit 0: MTL Rx Queue Write Controller Active Status */
#define ETH_MTLRXQDR_RRCSTS_SHIFT   (1)      /* Bits 1-2: MTL Rx Queue Read Controller State */
#define ETH_MTLRXQDR_RRCSTS_MASK    (0x3 << ETH_MTLRXQDR_RRCSTS_SHIFT)
#define ETH_MTLRXQDR_RXQSTS_SHIFT   (4)      /* Bits 4-5: MTL Rx Queue Fill-Level Status */
#define ETH_MTLRXQDR_RXQSTS_MASK    (0x3 << ETH_MTLRXQDR_RXQSTS_SHIFT)
#define ETH_MTLRXQDR_PRXQ_SHIFT     (16)     /* Bits 16-29: Number of Packets in Receive Queue */
#define ETH_MTLRXQDR_PRXQ_MASK      (0x3fff << ETH_MTLRXQDR_PRXQ_SHIFT)

/* Ethernet MAC MDIO data register */

/* Ethernet DMA registers ***************************************************/

#define ETH_DMAMR_SWR          (1 << 0)  /* Bit 0: Software Reset */
#define ETH_DMAMR_DA           (1 << 1)  /* Bit 1: DMA Tx or Rx Arbitration Scheme */
#define ETH_DMAMR_TXPR         (1 << 11) /* Bit 11: Transmit priority */
#define ETH_DMAMR_PR_SHIFT     (12)      /* Bits 12-14: Priority ratio */
#define ETH_DMAMR_PR_MASK      (0x7 << ETH_DMAMR_PR_SHIFT)
#  define ETH_DMAMR_PR_1TO1    (0x0 << ETH_DMAMR_PR_SHIFT)
#  define ETH_DMAMR_PR_2TO1    (0x1 << ETH_DMAMR_PR_SHIFT)
#  define ETH_DMAMR_PR_3TO1    (0x2 << ETH_DMAMR_PR_SHIFT)
#  define ETH_DMAMR_PR_4TO1    (0x3 << ETH_DMAMR_PR_SHIFT)
#  define ETH_DMAMR_PR_5TO1    (0x4 << ETH_DMAMR_PR_SHIFT)
#  define ETH_DMAMR_PR_6TO1    (0x5 << ETH_DMAMR_PR_SHIFT)
#  define ETH_DMAMR_PR_7TO1    (0x6 << ETH_DMAMR_PR_SHIFT)
#  define ETH_DMAMR_PR_8TO1    (0x7 << ETH_DMAMR_PR_SHIFT)

#define ETH_DMAMR_INTM_SHIFT   (16)    /* Bits 16-17: Interrupt Mode */
#define ETH_DMAMR_INTM_MASK    (0x3 << ETH_DMAMR_INTM_SHIFT)

#define STM32_ETH_DMASBMR_FB   (1 << 0)  /* Bit 0: Fixed Burst Length */
#define STM32_ETH_DMASBMR_AAL  (1 << 12) /* Bit 12: Address-Aligned Beats */
#define STM32_ETH_DMASBMR_MB   (1 << 14) /* Bit 14: Mixed Burst */
#define STM32_ETH_DMASBMR_RB   (1 << 15) /* Bit 15: Rebuild INCRx Burst */

#define ETH_DMACIER_TIE              (1 << 0)  /* Bit 0:  Transmit interrupt enable */
#define ETH_DMACIER_TXSE             (1 << 1)  /* Bit 1:  Transmit process stopped interrupt enable */
#define ETH_DMACIER_TBUE             (1 << 2)  /* Bit 2:  Transmit buffer unavailable interrupt enable */

#define ETH_DMACIER_RIE              (1 << 6)  /* Bit 6:  Receive interrupt enable */
#define ETH_DMACIER_RBUE             (1 << 7)  /* Bit 7:  Receive buffer unavailable interrupt enable */
#define ETH_DMACIER_RSE              (1 << 8)  /* Bit 8:  Receive process stopped interrupt enable */
#define ETH_DMACIER_RWTE             (1 << 9)  /* Bit 9:  Receive watchdog timeout interrupt enable */
#define ETH_DMACIER_ETIE             (1 << 10) /* Bit 10: Early transmit interrupt enable */
#define ETH_DMACIER_ERIE             (1 << 11) /* Bit 11: Early receive interrupt enable*/
#define ETH_DMACIER_FBEE             (1 << 12) /* Bit 12: Fatal bus error interrupt enable*/
#define ETH_DMACIER_CDEE             (1 << 13) /* Bit 13: Context descriptor error interrupt enable */
#define ETH_DMACIER_AIE              (1 << 14) /* Bit 14: Abnormal interrupt summary interrupt enable */
#define ETH_DMACIER_NIE              (1 << 15) /* Bit 15: Normal interrupt summary enable */

#define ETH_DMACSR_TI                (1 << 0)  /* Bit 0:  Transmit interrupt */
#define ETH_DMACSR_TPS               (1 << 1)  /* Bit 1:  Transmit process stopped interrupt */
#define ETH_DMACSR_TBU               (1 << 2)  /* Bit 2:  Transmit buffer unavailable interrupt */

#define ETH_DMACSR_RI                (1 << 6)  /* Bit 6:  Receive interrupt */
#define ETH_DMACSR_RBU               (1 << 7)  /* Bit 7:  Receive buffer unavailable interrupt */
#define ETH_DMACSR_RPS               (1 << 8)  /* Bit 8:  Receive process stopped interrupt */
#define ETH_DMACSR_RWT               (1 << 9)  /* Bit 9:  Receive watchdog timeout interrupt */
#define ETH_DMACSR_ETI               (1 << 10) /* Bit 10: Early transmit interrupt */
#define ETH_DMACSR_ERI               (1 << 11) /* Bit 11: Early receive interrupt */
#define ETH_DMACSR_FBE               (1 << 12) /* Bit 12: Fatal bus error interrupt */
#define ETH_DMACSR_CDE               (1 << 13) /* Bit 13: Context descriptor error interrupt */
#define ETH_DMACSR_AIS               (1 << 14) /* Bit 14: Abnormal interrupt summary interrupt */
#define ETH_DMACSR_NIS               (1 << 15) /* Bit 15: Normal interrupt summary */
#define ETH_DMACSR_TEB_SHIFT         (16)      /* Bits 16-18: Tx DMA error bits */
#define ETH_DMACSR_TEB_MASK          (0x7 << ETH_DMACSR_TEB_SHIFT)
#define ETH_DMACSR_REB_SHIFT         (19)      /* Bits 19-21: Rx DMA error bits */
#define ETH_DMACSR_REB_MASK          (0x7 << ETH_DMACSR_REB_SHIFT)

