apache/nuttx/arch/arm/src/stm32h7/hardware/stm32_ethernet.h
#define ETH_DMACTXDTPR_TDT_SHIFT      (2) /* Transmit Descriptor Tail Pointer */
#define ETH_DMACTXDTPR_TDT_MASK       (0x3fffffff << ETH_DMACTXDTPR_TDT_SHIFT)

#define ETH_DMACCR_MSS_SHIFT        (0)       /* Bits 0-13: Maximum Segment Size */
#define ETH_DMACCR_MSS_MASK         (0x3fff << ETH_DMACCR_MSS_SHIFT)
#define ETH_DMACCR_PBLX8            (1 << 16) /* Bit 16: 8xPBL mode */
#define ETH_DMACCR_DSL_SHIFT        (18)      /* Bits 18-20: Descriptor Skip Length */
#define ETH_DMACCR_DSL_MASK         (0x7 << ETH_DMACCR_DSL_SHIFT)
#define ETH_DMACCR_DSL(n)           ((n) << ETH_DMACCR_DSL_SHIFT)

#define ETH_DMACTXCR_ST             (1 << 0)  /* Bit 0: Start or Stop Transmission Command */
#define ETH_DMACTXCR_OSF            (1 << 4)  /* Bit 4: Operate on Second Packet */
#define ETH_DMACTXCR_TSE            (1 << 12) /* Bit 12: TCP Segmentation Enabled */
#define ETH_DMACTXCR_TXPBL_SHIFT    (16)      /* Bits 16-21: Transmit Programmable Burst Length */
#define ETH_DMACTXCR_TXPBL_MASK     (0x3f << ETH_DMACTXCR_TXPBL_SHIFT)
#define ETH_DMACTXCR_TXPBL(n)       ((n) << ETH_DMACTXCR_TXPBL_SHIFT)

#define ETH_DMACRXCR_SR             (1 << 0)  /* Bit0: Start or Stop Receive */
#define ETH_DMACRXCR_RBSZ_SHIFT     (1)       /* Bits 1-14: Receive Buffer size */
#define ETH_DMACRXCR_RBSZ_MASK      (0x3fff << ETH_DMACRXCR_RBSZ_SHIFT)
#define ETH_DMACRXCR_RBSZ(n)        ((n) << ETH_DMACRXCR_RBSZ_SHIFT)
#define ETH_DMACRXCR_RXPBL_SHIFT    (16)      /* Bits 16-21: Receive Programmable Burst Length */
#define ETH_DMACRXCR_RXPBL_MASK     (0x3f << ETH_DMACRXCR_RXPBL_SHIFT)
#define ETH_DMACRXCR_RXPBL(n)        ((n) << ETH_DMACRXCR_RXPBL_SHIFT)
#define ETH_DMACRXCR_RPF            (1 << 31) /* Bit 31: DMA Rx Channel Packet Flush */

/* DMA Descriptors **********************************************************/

/* TDES0: TDES0 normal descriptor, read-format
 *         (header or buf 1 address[31:0])
 * TDES1: TDES1 normal descriptor, read-format
 *         (buf2 address[31:0] or buf1 address[63:32]
 * TDES2: TDES2 normal descriptor, read-format
 */

#define ETH_TDES2_RD_HL_BL1_SHIFT    (0) /* Header Length or Buffer 1 Length */
#define ETH_TDES2_RD_HL_BL1_MASK     (0x3fff << ETH_TDES2_RD_HL_BL1_SHIFT)
#define ETH_TDES2_RD_VTIR_SHIFT      (14) /* VLAN Tag Insertion or Replacement */
#define ETH_TDES2_RD_VTIR_MASK       (0x3 << ETH_TDES2_RD_VTIR_SHIFT)
#define ETH_TDES2_RD_B2L_SHIFT       (16) /* Buffer 2 Length */
#define ETH_TDES2_RD_B2L_MASK        (0x3fff << ETH_TDES2_RD_B2L_SHIFT)
#define ETH_TDES2_RD_TTSE            (1 << 30)  /* Bit 30: Transmit Timestamp Enable */
#define ETH_TDES2_RD_IOC             (1 << 31)  /* Bit 31: Interrupt on Completion */

/* TDES3: TDES3 normal descriptor, read-format */

#define ETH_TDES3_RD_FL_TPL_SHIFT    (0) /* Packet Length or TCP Payload Length */
#define ETH_TDES3_RD_FL_TPL_MASK     (0x7fff << ETH_TDES3_RD_FL_TPL_SHIFT)
#define ETH_TDES3_RD_TPL             (1 << 15) /* Bit 15: Reserved or TCP Payload Length */

#define ETH_TDES3_RD_CIC_TPL_SHIFT   (16) /* Checksum Insertion Control or TCP Payload Length */
#define ETH_TDES3_RD_CIC_TPL_MASK    (0x3 << ETH_TDES3_RD_CIC_TPL_SHIFT)
#define ETH_TDES3_RD_TSE             (1 << 18) /* Bit 18: TCP Segmentation Enable */

#define ETH_TDES3_RD_THL_SHIFT       (19) /* TCP Header Length */
#define ETH_TDES3_RD_THL_MASK        (0xf << ETH_TDES3_RD_THL_SHIFT)
#define ETH_TDES3_RD_SAIC_SHIFT      (23) /* SA Insertion Control */
#define ETH_TDES3_RD_SAIC_MASK       (0x7 << ETH_TDES3_RD_SAIC_SHIFT)
#define ETH_TDES3_RD_CPC_SHIFT       (26) /* CRC Pad Control */
#define ETH_TDES3_RD_CPC_MASK        (0x3 << ETH_TDES3_RD_CPC_SHIFT)
#define ETH_TDES3_RD_LD              (1 << 28) /* Bit 28: Last Descriptor */
#define ETH_TDES3_RD_FD              (1 << 29) /* Bit 29: First Descriptor */
#define ETH_TDES3_RD_CTXT            (1 << 30) /* Bit 30: Context Type  */
#define ETH_TDES3_RD_OWN             (1 << 31) /* Bit 31: Own bit */

/* TDES0: TDES0 normal descriptor, write-back format (time stamp low)
 * TDES1: TDES1 normal descriptor, write-back format (time stamp high)
 * TDES2: TDES2 normal descriptor, write-back format (reserved)
 * TDES3: TDES3 normal descriptor, write-back format
 */

#define ETH_TDES3_WB_IHE             (1 << 0)  /* Bit 0:  IP Header Error */
#define ETH_TDES3_WB_DB              (1 << 1)  /* Bit 1:  Deferred bit */
#define ETH_TDES3_WB_UF              (1 << 2)  /* Bit 1:  Underflow error */
#define ETH_TDES3_WB_ED              (1 << 3)  /* Bit 2:  Excessive deferral */
#define ETH_TDES3_WB_CC_SHIFT        (4)       /* Bits 4-7: Collision count */
#define ETH_TDES3_WB_CC_MASK         (15 << ETH_TDES3_CC_WB_SHIFT)
#define ETH_TDES3_WB_EC              (1 << 8)  /* Bit 8:  Excessive collision */
#define ETH_TDES3_WB_LC              (1 << 9)  /* Bit 9:  Late collision */
#define ETH_TDES3_WB_NC              (1 << 10) /* Bit 10: No carrier */
#define ETH_TDES3_WB_LOC             (1 << 11) /* Bit 11: Loss of carrier */
#define ETH_TDES3_WB_PCE             (1 << 12) /* Bit 12: Payload checksum error */
#define ETH_TDES3_WB_FF              (1 << 13) /* Bit 13: Packet flushed */
#define ETH_TDES3_WB_JT              (1 << 14) /* Bit 14: Jabber timeout */
#define ETH_TDES3_WB_ES              (1 << 15) /* Bit 15: Error summary */
#define ETH_TDES3_WB_TTSS            (1 << 17) /* Bit 17: Transmit time stamp status */
#define ETH_TDES3_WB_LD              (1 << 28) /* Bit 28: Last Descriptor */
#define ETH_TDES3_WB_FD              (1 << 29) /* Bit 29: First Descriptor */
#define ETH_TDES3_WB_CTXT            (1 << 30) /* Bit 30: Context Type  */
#define ETH_TDES0_WB_OWN             (1 << 31) /* Bit 31: Own bit */

/* TDES0: TDES0 context descriptor (time stamp low)
 * TDES1: TDES1 context descriptor (time stamp high)
 * TDES2: TDES2 context descriptor
 */

#define ETH_CTX_TDES2_MSS_SHIFT      (0) /* Maximum Segment Size */
#define ETH_CTX_TDES2_MSS_MASK       (0x3fff << ETH_CTX_TDES2_MSS_SHIFT)
#define ETH_CTX_TDES2_IVT_SHIFT      (16) /* Inner VLAN Tag */
#define ETH_CTX_TDES2_IVT_MASK       (0xffff << ETH_CTX_TDES2_IVT_SHIFT)

