apache/nuttx/arch/arm/src/stm32h7/hardware/stm32_ethernet.h
/* TDES3: TDES3 context descriptor */

#define ETH_CTX_TDES3_VT_SHIFT      (0) /* VLAN Tag */
#define ETH_CTX_TDES3_VT_MASK       (0xffff << ETH_CTX_TDES3_VT_SHIFT)
#define ETH_CTX_TDES3_VLTV          (1 << 16) /* Bit 16: VLAN Tag Valid */
#define ETH_CTX_TDES3_IVLTV         (1 << 17) /* Bit 17: Inner VLAN Tag Valid */

#define ETH_CTX_TDES3_IVTIR_SHIFT   (18) /* Inner VLAN Tag Insert or Replace */
#define ETH_CTX_TDES3_IVTIR_MASK    (0x3 << ETH_CTX_TDES3_IVTIR_SHIFT)
#define ETH_CTX_TDES3_CDE           (1 << 23) /* Bit 23: Context Descriptor Error */
#define ETH_CTX_TDES3_TCMSSV        (1 << 26) /* Bit 26: One-Step Timestamp Correction Input or MSS Valid */
#define ETH_CTX_TDES3_OSTC          (1 << 27) /* Bit 27: One-Step Timestamp Correction Enable */
#define ETH_CTX_TDES3_CTXT          (1 << 30) /* Bit 30: Context Type */
#define ETH_CTX_TDES3_OWN           (1 << 31) /* Bit 31: Own bit */

/* RDES0: Receive descriptor Word0, read-format (Buffer 1 address[31:0])

 * RDES1: Receive descriptor Word1, read-format
 *    (Reserved or Header/Buffer 1 Address[63:32] address)
 * RDES2: Receive descriptor Word2, read-format
 *    (Payload or Buffer 2 Address[31:0])
 * RDES3: Receive descriptor Word3, read-format
 */

#define ETH_RDES3_RD_BUF1V          (1 << 24) /* Bit 24: Buffer 1 Address Valid */
#define ETH_RDES3_RD_BUF2V          (1 << 25) /* Bit 25: Buffer 2 Address Valid */
#define ETH_RDES3_RD_IOC            (1 << 30) /* Bit 30: Interrupt Enabled on Completion */
#define ETH_RDES3_RD_OWN            (1 << 31) /* Bit 31: Own bit */

/* RDES0: Receive descriptor Word0, write-back format */

#define ETH_RDES0_WB_OVT_SHIFT      (0)       /* Bits 0-15: Outer VLAN Tag */
#define ETH_RDES0_WB_OVT_MASK       (0xffff << ETH_RDES0_WB_OVT_SHIFT)
#define ETH_RDES0_WB_IVT_SHIFT      (16)      /* Bits 16-31: Inner VLAN Tag */
#define ETH_RDES0_WB_IVT_MASK       (0xffff << ETH_RDES0_WB_IVT_SHIFT)

/* RDES1: Receive descriptor Word1, write-back format */

#define ETH_RDES1_WB_PT_SHIFT       (0)       /* Bits 0-2: Payload Type */
#define ETH_RDES1_WB_PT_MASK        (0x7 << ETH_RDES1_WB_PT_SHIFT)
#  define ETH_RDES1_WB_PT_UNKNOWN   (0x0)
#  define ETH_RDES1_WB_PT_UDP       (0x1)
#  define ETH_RDES1_WB_PT_TCP       (0x2)
#  define ETH_RDES1_WB_PT_ICMP      (0x3)
#define ETH_RDES1_WB_IPHE           (1 << 3)  /* Bit 3: IP Header Error */
#define ETH_RDES1_WB_IPV4           (1 << 4)  /* Bit 4: IPv4 Header Present */
#define ETH_RDES1_WB_IPV6           (1 << 5)  /* Bit 5: IPv6 Header Present */
#define ETH_RDES1_WB_IPCB           (1 << 6)  /* Bit 6: IP Checksum Bypassed */
#define ETH_RDES1_WB_IPCE           (1 << 7)  /* Bit 7: IP Payload Error */
#define ETH_RDES1_WB_PMT_SHIFT      (8)       /* Bits 8-11: PTP Message Type */
#define ETH_RDES1_WB_PMT_MASK       (0xf << ETH_RDES1_WB_PMT_SHIFT)
#define ETH_RDES1_WB_PFT            (1 << 12) /* Bit 12: PTP Packet Type */
#define ETH_RDES1_WB_PV             (1 << 13) /* Bit 13: PTP Version */
#define ETH_RDES1_WB_TSA            (1 << 14) /* Bit 14: Timestamp Available */
#define ETH_RDES1_WB_TD             (1 << 15) /* Bit 15: Timestamp Dropped */
#define ETH_RDES1_WB_OPC_SHIFT      (16)      /* Bits 16-31: OAM Sub-Type Code, or MAC Control Packet opcode */
#define ETH_RDES1_WB_OPC_MASK       (0xffff << ETH_RDES1_WB_OPC_SHIFT)

/* RDES2: Receive descriptor Word2, write-back format */

#define ETH_RDES2_WB_ARPNR          (1 << 10) /* Bit 10: ARP Reply Not Generated */
#define ETH_RDES2_WB_VF             (1 << 15) /* Bit 15: VLAN Filter Status */
#define ETH_RDES2_WB_SAF            (1 << 16) /* Bit 16: SA Address Filter Fail */
#define ETH_RDES2_WB_DAF            (1 << 17) /* Bit 17: Destination Address Filter Fail */
#define ETH_RDES2_WB_HF             (1 << 18) /* Bit 18: Hash Filter Status */
#define ETH_RDES2_WB_MADRM_SHIFT    (19)      /* Bits 19-26: MAC Address Match or Hash Value */
#define ETH_RDES2_WB_MADRM_MASK     (0xff << ETH_RDES1_WB_MADRM_SHIFT)
#define ETH_RDES2_WB_L3FM           (1 << 27) /* Bit 27: Layer 3 Filter Match */
#define ETH_RDES2_WB_L4FM           (1 << 28) /* Bit 28: Layer 4 Filter Match */
#define ETH_RDES2_WB_L3L4FM_SHIFT   (29)      /* Bits 29-31: Layer 3 and Layer 4 Filter Number Matched */
#define ETH_RDES2_WB_L3L4FM_MASK    (0x7 << ETH_RDES1_WB_L3L4FM_SHIFT)

/* RDES3: Receive descriptor Word3, write-back format */

#define ETH_RDES3_WB_PL_SHIFT       (0)      /* Bits 0-14: Packet Length */
#define ETH_RDES3_WB_PL_MASK        (0x7fff << ETH_RDES3_WB_PL_SHIFT)
#define ETH_RDES3_WB_ES             (1 << 15) /* Bit 15: Error Summary */
#define ETH_RDES3_WB_LT_SHIFT       (16)      /* Bits 16-18: Length/Type Field */
#define ETH_RDES3_WB_LT_MASK        (0x7 << ETH_RDES3_WB_LT_SHIFT)
#define ETH_RDES3_WB_DE             (1 << 19) /* Bit 19: Dribble Bit Error */
#define ETH_RDES3_WB_RE             (1 << 20) /* Bit 20: Receive Error */
#define ETH_RDES3_WB_OE             (1 << 21) /* Bit 21: Overflow Error */
#define ETH_RDES3_WB_RWT            (1 << 22) /* Bit 22: Receive Watchdog Timeout */
#define ETH_RDES3_WB_GP             (1 << 23) /* Bit 23: Giant Packet */
#define ETH_RDES3_WB_CE             (1 << 24) /* Bit 24: CRC Error */
#define ETH_RDES3_WB_RS0V           (1 << 25) /* Bit 25: Receive Status RDES0 Valid */
#define ETH_RDES3_WB_RS1V           (1 << 26) /* Bit 26: Receive Status RDES1 Valid */
#define ETH_RDES3_WB_RS2V           (1 << 27) /* Bit 27: Receive Status RDES2 Valid */
#define ETH_RDES3_WB_LD             (1 << 28) /* Bit 28: Last Descriptor */
#define ETH_RDES3_WB_FD             (1 << 29) /* Bit 29: First Descriptor */
#define ETH_RDES3_WB_CTXT           (1 << 30) /* Bit 30: Context Type  */
#define ETH_RDES3_WB_OWN            (1 << 31) /* Bit 31: Own bit */

/* RDES0: RDES0 context descriptor (time stamp low)
 * RDES1: RDES1 context descriptor (time stamp high)
 * RDES2: RDES2 context descriptor (reserved)
 * RDES3: RDES3 context descriptor
 */

#define ETH_CTX_RDES3_CTXT          (1 << 30) /* Bit 30: Context Type  */
#define ETH_CTX_RDES3_OWN           (1 << 31) /* Bit 31: Own bit */

/****************************************************************************
 * Public Types
 ****************************************************************************/

#ifndef __ASSEMBLY__

/* Ethernet RX/TX DMA Descriptor */

struct eth_desc_s
{
  /* DMA descriptor words */

  volatile uint32_t des0;
  volatile uint32_t des1;
  volatile uint32_t des2;
  volatile uint32_t des3;
};

/****************************************************************************
 * Public Functions Prototypes
 ****************************************************************************/

#endif /* __ASSEMBLY__ */
#endif /* CONFIG_STM32_STM32H7X3XX || CONFIG_STM32_STM32H7B3XX */
#endif /* __ARCH_ARM_SRC_STM32H7_HARDWARE_STM32_ETHERNET_H */
